Revit 2027 API
Tile.TileEdgeRoughness Property
 The property labeled "Roughness" from the "Tile" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string TileEdgeRoughness { get; }
Public Shared ReadOnly Property TileEdgeRoughness As String
	Get
public:
static property String^ TileEdgeRoughness {
	String^ get ();
}
static member TileEdgeRoughness : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 200".
See Also
Reference
Tile Class
Autodesk.Revit.DB.Visual Namespace